In [33]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
import math

In [34]:
df = pd.read_csv('homeprices.csv')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [35]:
df.bedrooms.median()

4.0

In [36]:
df.bedrooms = df.bedrooms.fillna(math.floor(df.bedrooms.median()))

reg = LinearRegression()

reg.fit(df[['bedrooms', 'age','area']],df.price)

LinearRegression()

In [37]:
print(reg.coef_)
print(reg.intercept_)

[23388.88007794 -3231.71790863   112.06244194]
221323.00186540704

In [50]:
# predict for 3000 sqft 3 bedrooms and 40 year
# predict for 2500 sqft 4 bedrooms and 5 years old

pred1 = reg.predict([[3000,3,40]])
pred2 = reg.predict([[2500,4,5]])
print(pred1,pred2)

[70382750.57963265] [58681156.6372868]

In [106]:
# Exercise

dfex = pd.read_csv('hiring.csv')
dfex
dfex.experience.fillna('zero',inplace = True)

In [107]:
#pip install Word2Number
dfex

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [108]:
from word2number import w2n
dfex.dtypes

experience                     object
test_score(out of 10)         float64
interview_score(out of 10)      int64
salary($)                       int64
dtype: object

In [109]:
dfex['experience'] = pd.Series(dfex['experience'], dtype="string") # to convert datatype to string of experience col
dfex
#df['id'] = pandas.Series(df['id'], dtype=pandas.StringDtype)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [120]:
dfex.dtypes

experience                     string
test_score(out of 10)         float64
interview_score(out of 10)      int64
salary($)                       int64
dtype: object

In [122]:
#on experience col for each value x we are running w2nword_to_num function 


dfex[['experience']] = dfex[['experience']].applymap(lambda x :w2n.word_to_num(str(x)))
dfex

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [141]:
score_median = dfex[['test_score(out of 10)']].median()
print(score_median)
dfex[['test_score(out of 10)']] = dfex[['test_score(out of 10)']].fillna(score_median)
dfex.columns

test_score(out of 10)    8.0
dtype: float64

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [134]:
reg = LinearRegression()

In [144]:
reg.fit(dfex[['experience','test_score(out of 10)','interview_score(out of 10)']],dfex['salary($)'])

LinearRegression()

In [149]:
# predict for 2 year experience , 9 score , 6 interview score
# and 12 , 10, 10
pred1 = reg.predict([[2,9,6]])
pred2 = reg.predict([[12,10,10]])
print(pred1,pred2)

[53205.96797671] [92002.18340611]